#- Создайте таблицу accounts с двумя полями: id и balance.
#- Вставьте начальные данные в таблицу: например, учетную запись с id=1 и balance=1000.

select*from employees; #/Сначала выгрузил таблицу

create table accounts  #/Далее создал таблицу
(id int primary key,  #/id (первичный ключ, #/ прерывание баланса
 balance int 
 );
 #/id (первичный ключ, #/ прерывание

 insert into  accounts(id,balance) #/Вывел значения на 
 values(1,100); #/от 1 до 100
 
 select*from accounts; #/Запустил таблицу и высвелились 2 столбца id и balance, а также 1 и 100.
 
#Запуск первого сеанса:
# Настройте уровень изоляции на READ UNCOMMITTED.
#Начните транзакцию.
#Измените баланс учетной записи, но не подтверждайте изменения.

set transaction isolation level read   #Сделал уровень транзакции, чтобы прочитать
#незафиксированную транзакцию;
uncommitted; #запустил транзакцию;
start transaction;
update accounts set balance=200 #обновил  записи, поменяв на баланс=200 
where id=1;  #где id=1;
 
 select*from accounts;  #/Запустил таблицу и высвелились 2 столбца id и balance, а также 1 и 200.
 
 #Запуск второго сеанса:
#Настройте уровень изоляции на READ UNCOMMITTED.
#Выполните запрос к таблице accounts, 
#чтобы увидеть измененные данные, которые еще не были подтверждены первым сеансом.

set transaction isolation level read           # установил уровень  транзакций
uncommitted;                                   # где нет чтения
 select*from accounts                          # выбрал из учетной записаи, где id=1
 where id=1;
 
 

 select*from accounts; #Вывод баланса 200
 
 #Завершение первого сеанса:
#В первом сеансе выполните ROLLBACK.
#Снова запустите запрос во втором сеансе, чтобы увидеть, как данные вернулись к исходному состоянию.

rollback; #Кнопку Отмена, чтобы веруть в исходное положение

select*from accounts where id=1; #Снова баланс стал 100
 